# ETL Project - MLS

In [61]:
# Import Dependencies
import pandas as pd
import numpy as np
from pandas.api.types import CategoricalDtype

from sqlalchemy import create_engine
from config import PH_User_Name
from config import PH_Password

Data Cleaning Secetion

In [62]:
#
#
# Read CSV files in pandas
mmls_path = ('mens_major_league_soccer.csv')
mls_salaries_path = ('mls-salaries-2017.csv')
mmls_data = pd.read_csv(mmls_path, encoding="ISO-8859-1")
mls_salaries = pd.read_csv(mls_salaries_path, encoding="ISO-8859-1")

In [63]:
# Preview of the DataFrame
mmls_data_temp = mmls_data.iloc[4:]
mmls_data_temp2 = mmls_data_temp.rename(columns=mmls_data_temp.iloc[0]).drop(mmls_data_temp.index[0])
mmls_data_temp2.describe()

,Rk,Player,Nation,Pos,Squad,Age,Born,MP,Starts,Min,...,PK,PKatt,CrdY,CrdR,Gls,Ast,G+A,G-PK,G+A-PK,Matches
count,588,588,588,588,588,588,588,588,588,588,...,588,588,588,588,588,588,588,588,588,588
unique,588,575,77,10,22,22,22,34,35,497,...,7,8,12,5,72,51,94,66,91,1
top,379,Mohammed Saeid\Mohammed-Saeid,us USA,DF,Vancouver,26,1990,1,0,90,...,0,0,0,0,0,0,0,0,0,Matches
freq,1,2,270,168,31,62,60,36,49,7,...,547,539,177,507,308,299,223,311,224,588

In [92]:
# Remove special characters from Player column and separate Player Names
mmls_data_temp2[['Name1','Name2']] = pd.DataFrame(mmls_data_temp2.Player.str.split(r'\\',1).tolist())
mmls_data_temp3 = mmls_data_temp2.drop(['Player', 'Name1', 'Matches'], axis=1)
mmls_data_temp4 = mmls_data_temp3.rename(columns = {'Name2':'Play'})
mmls_data_temp4['Player'] = mmls_data_temp4['Play'].str.replace('-',' ')
mmls_data_df = mmls_data_temp4.drop(['Play'], axis=1)
# mmls_data_df[['Rk', 'Age', 'Born', 'MP','Starts', 'Min', 'Gls', 'Gls', 'Ast', 'Ast',
#                      'PK', 'PKatt', 'CrdY', 'CrdR', 'Gls', 'Gls', 'Ast', 'Ast', 'G+A', 'G-PK',
#                      'G+A-PK']].astype(float)
mmls_data_df.head()

,Rk,Nation,Pos,Squad,Age,Born,MP,Starts,Min,Gls,...,PK,PKatt,CrdY,CrdR,Gls,Ast,G+A,G-PK,G+A-PK,Player
5,1,us USA,DF,Sporting KC,25,1991,12,10,902,1,...,0,0,1,0,0.1,0.1,0.2,0.1,0.2,Kellyn Acosta
6,2,gh GHA,MF,Columbus,25,1991,20,14,1279,0,...,0,0,3,0,0,0,0,0,0,Luciano Acosta
7,3,gh GHA,DF,Columbus,22,1994,7,6,529,1,...,0,0,2,1,0.17,0,0.17,0.17,0.17,Tyler Adams
8,4,gh GHA,MFFW,Chicago,26,1990,30,24,2194,14,...,2,2,2,0,0.57,0.25,0.82,0.49,0.74,Seyi Adekoya
9,5,us USA,DF,Real Salt Lake,19,1997,17,16,1408,0,...,0,0,2,1,0,0.06,0.06,0,0.06,Fanendo Adi

In [65]:
mls_salaries.rename(columns = {'Unnamed: 6':'Player'}, inplace = True)
mls_salaries_df = mls_salaries.drop(['last_name','first_name', 'position'], axis=1)
mls_salaries_df.head()

  club  base_salary  guaranteed_compensation           Player
0  ATL    1912500.0               2297000.00   Miguel Almiron
1  ATL      65625.0                 65625.00    Mikey Ambrose
2  ATL     150000.0                150000.00       Yamil Asad
3  ATL      99225.0                106573.89       Mark Bloom
4  ATL      65000.0                 77400.00  Andrew Carleton

Merge Databases

In [30]:
mls_df = pd.merge(mmls_data_df, mls_salaries_df, how='inner', on=['Player'])
mls_df.head()

,Rk,Nation,Pos,Squad,Age,Born,MP,Starts,Min,Gls,...,CrdR,Gls,Ast,G+A,G-PK,G+A-PK,Player,club,base_salary,guaranteed_compensation
0,1,us USA,DF,Sporting KC,25,1991,12,10,902,1,...,0,0.1,0.1,0.2,0.1,0.2,Kellyn Acosta,DAL,260000.0,280000.00
1,2,gh GHA,MF,Columbus,25,1991,20,14,1279,0,...,0,0,0,0,0,0,Luciano Acosta,DC,500000.0,602000.00
2,3,gh GHA,DF,Columbus,22,1994,7,6,529,1,...,1,0.17,0,0.17,0.17,0.17,Tyler Adams,NYRB,75000.0,91041.67
3,4,gh GHA,MFFW,Chicago,26,1990,30,24,2194,14,...,0,0.57,0.25,0.82,0.49,0.74,Seyi Adekoya,SEA,53004.0,53004.00
4,5,us USA,DF,Real Salt Lake,19,1997,17,16,1408,0,...,1,0,0.06,0.06,0,0.06,Fanendo Adi,POR,1190004.0,1736254.00

In [91]:
mls_df = mls_df[['Player', 'Pos', 'Rk', 'Nation', 'club', 'Squad', 'Age', 'Born', 'MP', 'Starts', 'Min',
                  'Gls', 'Ast', 'PK', 'PKatt', 'CrdY', 'CrdR', 'Gls', 'Ast', 'G+A',
                  'G-PK', 'G+A-PK', 'base_salary', 'guaranteed_compensation']].copy()
mls_df.dropna(how='any', inplace=True)
mls_df['Cost per Min'] = round(mls_df['base_salary'] / mls_df['Min'].astype(float),2)
mls_df.head()

,Player,Pos,Rk,Nation,club,Squad,Age,Born,MP,Starts,...,Ast,Ast,Ast,Ast,G+A,G-PK,G+A-PK,base_salary,guaranteed_compensation,Cost per Min
0,Kellyn Acosta,DF,1,us USA,DAL,Sporting KC,25,1991,12,10,...,1,0.1,1,0.1,0.2,0.1,0.2,260000.0,280000.00,288.25
1,Luciano Acosta,MF,2,gh GHA,DC,Columbus,25,1991,20,14,...,0,0,0,0,0,0,0,500000.0,602000.00,390.93
2,Tyler Adams,DF,3,gh GHA,NYRB,Columbus,22,1994,7,6,...,0,0,0,0,0.17,0.17,0.17,75000.0,91041.67,141.78
3,Seyi Adekoya,MFFW,4,gh GHA,SEA,Chicago,26,1990,30,24,...,6,0.25,6,0.25,0.82,0.49,0.74,53004.0,53004.00,24.16
4,Fanendo Adi,DF,5,us USA,POR,Real Salt Lake,19,1997,17,16,...,1,0.06,1,0.06,0.06,0,0.06,1190004.0,1736254.00,845.17

In [36]:
# rds_connection_string = "<insert user name>:<insert password>@localhost:5432/customer_db"
# engine = create_engine(f'postgresql://{rds_connection_string}')
engine = create_engine(f'postgresql://{PH_User_Name}:{PH_Password}@localhost:5432/ETL_Team007_Project')

In [37]:
engine.table_names()

[]

In [38]:
mls_df.to_sql(name='mls', con=engine, if_exists='append', index=False)

Next Steps

Next Steps 2